qmckl_examples.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-14 Sat 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Code examples</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Code examples</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7f68b0d">1. Overlap matrix in the MO basis</a>
<ul>
<li><a href="#orga5103c6">1.1. Python</a></li>
<li><a href="#org2841d87">1.2. C</a></li>
<li><a href="#org3b53bb5">1.3. Fortran</a></li>
</ul>
</li>
<li><a href="#org8f57567">2. Fortran</a>
<ul>
<li><a href="#org1446f90">2.1. Checking errors</a></li>
<li><a href="#org32d6be8">2.2. Computing an atomic orbital on a grid</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7f68b0d" class="outline-2">
<h2 id="org7f68b0d"><span class="section-number-2">1</span> Overlap matrix in the MO basis</h2>
<div class="outline-text-2" id="text-1">
<p>
The focal point of this example is the numerical evaluation of the overlap
matrix in the MO basis. Utilizing QMCkl, we approximate the MOs at
discrete grid points to compute the overlap matrix \( S_{ij} \) as follows:
\[
S_{ij} = \int \phi_i(\mathbf{r})\, \phi_j(\mathbf{r}) \text{d}\mathbf{r} \approx
         \sum_k \phi_i(\mathbf{r}_k)\, \phi_j(\mathbf{r}_k) \delta\mathbf{r}
\]
</p>


<p>
The code starts by reading a wave function from a TREXIO file.  This is
accomplished using the <code>qmckl_trexio_read</code> function, which populates a
<code>qmckl_context</code> with the necessary wave function parameters.  The context
serves as the primary interface for interacting with the QMCkl library,
encapsulating the state and configurations of the system.
Subsequently, the code retrieves various attributes such as the number of
nuclei <code>nucl_num</code> and coordinates <code>nucl_coord</code>.
These attributes are essential for setting up the integration grid.
</p>

<p>
The core of the example lies in the numerical computation of the overlap
matrix. To achieve this, the code employs a regular grid in three-dimensional
space, and the grid points are then populated into the <code>qmckl_context</code> using
the <code>qmckl_set_point</code> function.
</p>

<p>
The MO values at these grid points are computed using the
<code>qmckl_get_mo_basis_mo_value</code> function.  These values are then used to
calculate the overlap matrix through a matrix multiplication operation
facilitated by the <code>qmckl_dgemm</code> function.
</p>

<p>
The code is also instrumented to measure the execution time for the MO
value computation, providing an empirical assessment of the computational
efficiency. Error handling is robustly implemented at each stage to ensure the
reliability of the simulation.
</p>

<p>
In summary, this example serves as a holistic guide for leveraging the QMCkl
library, demonstrating its ease of use. It provides a concrete starting point
for researchers and developers interested in integrating QMCkl into their QMC
code.
</p>
</div>
