qmckl_examples.html

<div id="outline-container-orga5103c6" class="outline-3">
<h3 id="orga5103c6"><span class="section-number-3">1.1</span> Python</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In this example, we will compute numerically the overlap
between the molecular orbitals:
</p>

<p>
\[
      S_{ij} = \int \phi_i(\mathbf{r}) \phi_j(\mathbf{r})
   \text{d}\mathbf{r} \sim \sum_{k=1}^{N} \phi_i(\mathbf{r}_k)
   \phi_j(\mathbf{r}_k) \delta \mathbf{r}
   \]
\[
      S_{ij} = \langle \phi_i | \phi_j \rangle
   \sim \sum_{k=1}^{N} \langle \phi_i | \mathbf{r}_k \rangle
   \langle \mathbf{r}_k | \phi_j \rangle
   \]
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np
<span style="color: #a020f0;">import</span> qmckl
</pre>
</div>

<p>
First, we create a context for the QMCkl calculation, and load the
wave function stored in <code>h2o_5z.h5</code> inside it. It is a Hartree-Fock
determinant for the water molecule in the cc-pV5Z basis set.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">trexio_filename</span> = <span style="color: #8b2252;">"..//share/qmckl/test_data/h2o_5z.h5"</span>

<span style="color: #a0522d;">context</span> = qmckl.context_create()
qmckl.trexio_read(context, trexio_filename)
</pre>
</div>

<p>
We now define the grid points \(\mathbf{r}_k\) as a regular grid around the
molecule.
</p>

<p>
We fetch the nuclear coordinates from the context,
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">nucl_num</span> = qmckl.get_nucleus_num(context)

<span style="color: #a0522d;">nucl_charge</span> = qmckl.get_nucleus_charge(context, nucl_num)

<span style="color: #a0522d;">nucl_coord</span> = qmckl.get_nucleus_coord(context, <span style="color: #8b2252;">'N'</span>, nucl_num*3)
<span style="color: #a0522d;">nucl_coord</span> = np.reshape(nucl_coord, (3, nucl_num))

<span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(nucl_num):
    <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"%d  %+f %+f %+f"</span>%(<span style="color: #483d8b;">int</span>(nucl_charge[i]),
                             nucl_coord[i,0],
                             nucl_coord[i,1],
                             nucl_coord[i,2]) )
</pre>
</div>

<pre class="example">
8  +0.000000 +0.000000 +0.000000
1  -1.430429 +0.000000 -1.107157
1  +1.430429 +0.000000 -1.107157
</pre>

<p>
and compute the coordinates of the grid points:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">nx</span> = ( 120, 120, 120 )
<span style="color: #a0522d;">shift</span> = np.array([5.,5.,5.])
<span style="color: #a0522d;">point_num</span> = nx[0] * nx[1] * nx[2]

<span style="color: #a0522d;">rmin</span>  = np.array( <span style="color: #483d8b;">list</span>([ np.<span style="color: #483d8b;">min</span>(nucl_coord[:,a]) <span style="color: #a020f0;">for</span> a <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3) ]) )
<span style="color: #a0522d;">rmax</span>  = np.array( <span style="color: #483d8b;">list</span>([ np.<span style="color: #483d8b;">max</span>(nucl_coord[:,a]) <span style="color: #a020f0;">for</span> a <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3) ]) )


<span style="color: #a0522d;">linspace</span> = [ <span style="color: #008b8b;">None</span> <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3) ]
<span style="color: #a0522d;">step</span>     = [ <span style="color: #008b8b;">None</span> <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3) ]
<span style="color: #a020f0;">for</span> a <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(3):
    linspace[a], <span style="color: #a0522d;">step</span>[a] = np.linspace(rmin[a]-shift[a],
                                       rmax[a]+shift[a],
                                       num=nx[a],
                                       retstep=<span style="color: #008b8b;">True</span>)

<span style="color: #a0522d;">dr</span> = step[0] * step[1] * step[2]
</pre>
</div>

<p>
Now the grid is ready, we can create the list of grid points
\(\mathbf{r}_k\) on which the MOs \(\phi_i\) will be evaluated, and
transfer them to the QMCkl context:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">point</span> = []
<span style="color: #a020f0;">for</span> x <span style="color: #a020f0;">in</span> linspace[0]:
    <span style="color: #a020f0;">for</span> y <span style="color: #a020f0;">in</span> linspace[1]:
        <span style="color: #a020f0;">for</span> z <span style="color: #a020f0;">in</span> linspace[2]:
            <span style="color: #a0522d;">point</span> += [ [x, y, z] ]

<span style="color: #a0522d;">point</span> = np.array(point)
<span style="color: #a0522d;">point_num</span> = <span style="color: #483d8b;">len</span>(point)
qmckl.set_point(context, <span style="color: #8b2252;">'N'</span>, point_num, np.reshape(point, (point_num*3)))
</pre>
</div>

<p>
Then, we evaluate all the MOs at the grid points (and time the execution),
and thus obtain the matrix \(M_{ki} = \langle \mathbf{r}_k | \phi_i \rangle =
   \phi_i(\mathbf{r}_k)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> time

<span style="color: #a0522d;">mo_num</span> = qmckl.get_mo_basis_mo_num(context)

<span style="color: #a0522d;">before</span>   = time.time()
<span style="color: #a0522d;">mo_value</span> = qmckl.get_mo_basis_mo_value(context, point_num*mo_num)
<span style="color: #a0522d;">after</span>    = time.time()

<span style="color: #a0522d;">mo_value</span> = np.reshape( mo_value, (point_num, mo_num) ).T   # <span style="color: #b22222;">Transpose to get mo_num x point_num</span>

<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Number of MOs: "</span>, mo_num)
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Number of grid points: "</span>, point_num)
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Execution time : "</span>, (after - before), <span style="color: #8b2252;">"seconds"</span>)

</pre>
</div>

<pre class="example">
Number of MOs:  201
Number of grid points:  1728000
Execution time :  5.577778577804565 seconds
</pre>

<p>
and finally we compute the overlap between all the MOs as
\(M.M^\dagger\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">overlap</span> = mo_value @ mo_value.T * dr
<span style="color: #a020f0;">print</span> (overlap)
</pre>
</div>

<pre class="example">
[[ 9.88693941e-01  2.34719693e-03 -1.50518232e-08 ...  3.12084178e-09
  -5.81064929e-10  3.70130091e-02]
 [ 2.34719693e-03  9.99509628e-01  3.18930040e-09 ... -2.46888958e-10
  -1.06064273e-09 -7.65567973e-03]
 [-1.50518232e-08  3.18930040e-09  9.99995073e-01 ... -5.84882580e-06
  -1.21598117e-06  4.59036468e-08]
 ...
 [ 3.12084178e-09 -2.46888958e-10 -5.84882580e-06 ...  1.00019107e+00
  -2.03342837e-04 -1.36954855e-08]
 [-5.81064929e-10 -1.06064273e-09 -1.21598117e-06 ... -2.03342837e-04
   9.99262427e-01  1.18264754e-09]
 [ 3.70130091e-02 -7.65567973e-03  4.59036468e-08 ... -1.36954855e-08
   1.18264754e-09  8.97215950e-01]]
</pre>
</div>
</div>
