qmckl_examples.html

<div id="outline-container-org2841d87" class="outline-3">
<h3 id="org2841d87"><span class="section-number-3">1.2</span> C</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In this example, electron-nucleus cusp fitting is added.
</p>

<p>
In this example, we will compute numerically the overlap
between the molecular orbitals:
</p>

<p>
\[
      S_{ij} = \int \phi_i(\mathbf{r}) \phi_j(\mathbf{r})
   \text{d}\mathbf{r} \sim \sum_{k=1}^{N} \phi_i(\mathbf{r}_k)
   \phi_j(\mathbf{r}_k) \delta \mathbf{r}
   \]
\[
      S_{ij} = \langle \phi_i | \phi_j \rangle
   \sim \sum_{k=1}^{N} \langle \phi_i | \mathbf{r}_k \rangle
   \langle \mathbf{r}_k | \phi_j \rangle
   \]
</p>

<p>
We apply the cusp fitting procedure, so the MOs might deviate
slightly from orthonormality.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;qmckl.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;sys/time.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>** <span style="color: #a0522d;">argv</span>)
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">trexio_filename</span> = <span style="color: #8b2252;">"..//share/qmckl/test_data/h2o_5z.h5"</span>;
  <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span> = QMCKL_SUCCESS;
</pre>
</div>

<p>
First, we create a context for the QMCkl calculation, and load the
wave function stored in <code>h2o_5z.h5</code> inside it. It is a Hartree-Fock
determinant for the water molecule in the cc-pV5Z basis set.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span> = qmckl_context_create();

rc = qmckl_trexio_read(context, trexio_filename, strlen(trexio_filename));

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error reading TREXIO file:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}

</pre>
</div>

<p>
We impose the electron-nucleus cusp fitting to occur when the
electrons are close to the nuclei. The critical distance
is 0.5 atomic units for hydrogens and 0.1 for the oxygen.
To identify which atom is an oxygen and which are hydrogens, we
fetch the nuclear charges from the context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">nucl_num</span>;

rc = qmckl_get_nucleus_num(context, &amp;nucl_num);

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error getting nucl_num:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}


<span style="color: #228b22;">double</span> <span style="color: #a0522d;">nucl_charge</span>[nucl_num];

rc = qmckl_get_nucleus_charge(context, &amp;(nucl_charge[0]), nucl_num);

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error getting nucl_charge:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}


<span style="color: #228b22;">double</span> <span style="color: #a0522d;">r_cusp</span>[nucl_num];

<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nucl_num ; ++i) {

  <span style="color: #a020f0;">switch</span> ((<span style="color: #228b22;">int</span>) nucl_charge[i]) {

  <span style="color: #a020f0;">case</span> 1:
    r_cusp[i] = 0.5;
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> 8:
    r_cusp[i] = 0.1;
    <span style="color: #a020f0;">break</span>;
  }

}


rc = qmckl_set_mo_basis_r_cusp(context, &amp;(r_cusp[0]), nucl_num);

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error setting r_cusp:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}


</pre>
</div>


<p>
We now define the grid points \(\mathbf{r}_k\) as a regular grid around the
molecule.
We fetch the nuclear coordinates from the context,
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span> <span style="color: #a0522d;">nucl_coord</span>[nucl_num][3];

rc = qmckl_get_nucleus_coord(context, <span style="color: #8b2252;">'N'</span>, &amp;(nucl_coord[0][0]), nucl_num*3);

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error getting nucl_coord:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}

<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nucl_num ; ++i) {
  printf(<span style="color: #8b2252;">"%d  %+f %+f %+f\n"</span>,
         (<span style="color: #228b22;">int32_t</span>) nucl_charge[i],
         nucl_coord[i][0],
         nucl_coord[i][1],
         nucl_coord[i][2]);
}
</pre>
</div>

<pre class="example">
8  +0.000000 +0.000000 +0.000000
1  -1.430429 +0.000000 -1.107157
1  +1.430429 +0.000000 -1.107157
</pre>

<p>
and compute the coordinates of the grid points:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">nx</span>[3] = { 120, 120, 120 };
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">shift</span>[3] = {5.,5.,5.};
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">point_num</span> = nx[0] * nx[1] * nx[2];

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">rmin</span>[3] = { nucl_coord[0][0], nucl_coord[0][1], nucl_coord[0][2] } ;
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">rmax</span>[3] = { nucl_coord[0][0], nucl_coord[0][1], nucl_coord[0][2] } ;

<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nucl_num ; ++i) {
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span>=0 ; j&lt;3 ; ++j) {
    rmin[j] = nucl_coord[i][j] &lt; rmin[j] ? nucl_coord[i][j] : rmin[j];
    rmax[j] = nucl_coord[i][j] &gt; rmax[j] ? nucl_coord[i][j] : rmax[j];
  }
}

<span style="color: #228b22;">rmin</span>[0] -= shift[0]; <span style="color: #228b22;">rmin</span>[1] -= shift[1]; <span style="color: #228b22;">rmin</span>[2] -= shift[2];
<span style="color: #228b22;">rmax</span>[0] += shift[0]; <span style="color: #228b22;">rmax</span>[1] += shift[1]; <span style="color: #228b22;">rmax</span>[2] += shift[2];

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">step</span>[3];

<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">linspace</span>[3];
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;3 ; ++i) {

  linspace[i] = (<span style="color: #228b22;">double</span>*) calloc( <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>), nx[i] );

  <span style="color: #a020f0;">if</span> (linspace[i] == <span style="color: #008b8b;">NULL</span>) {
    fprintf(stderr, <span style="color: #8b2252;">"Allocation failed (linspace)\n"</span>);
    exit(1);
  }

  step[i] = (rmax[i] - rmin[i]) / ((<span style="color: #228b22;">double</span>) (nx[i]-1));

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">j</span>=0 ; j&lt;nx[i] ; ++j) {
    linspace[i][j] = rmin[i] + j*step[i];
  }

}

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">dr</span> = step[0] * step[1] * step[2];
</pre>
</div>

<p>
Now the grid is ready, we can create the list of grid points
\(\mathbf{r}_k\) on which the MOs \(\phi_i\) will be evaluated, and
transfer them to the QMCkl context:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span>* <span style="color: #a0522d;">point</span> = (<span style="color: #228b22;">double</span>*) calloc(<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>), 3*point_num);

<span style="color: #a020f0;">if</span> (point == <span style="color: #008b8b;">NULL</span>) {
  fprintf(stderr, <span style="color: #8b2252;">"Allocation failed (point)\n"</span>);
  exit(1);
}

<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">m</span> = 0;
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nx[0] ; ++i) {
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">j</span>=0 ; j&lt;nx[1] ; ++j) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">k</span>=0 ; k&lt;nx[2] ; ++k) {

      point[m] = linspace[0][i];
      m++;

      point[m] = linspace[1][j];
      m++;

      point[m] = linspace[2][k];
      m++;

    }
  }
}

rc = qmckl_set_point(context, <span style="color: #8b2252;">'N'</span>, point_num, point, (point_num*3));

<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error setting points:\n%s\n"</span>, qmckl_string_of_error(rc));
  exit(1);
}
</pre>
</div>

<p>
Then, we evaluate all the MOs at the grid points (and time the execution),
and thus obtain the matrix \(M_{ki} = \langle \mathbf{r}_k | \phi_i
   \rangle = \phi_i(\mathbf{r}_k)\).
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">mo_num</span>;
rc = qmckl_get_mo_basis_mo_num(context, &amp;mo_num);

<span style="color: #228b22;">long</span> <span style="color: #a0522d;">before</span>, <span style="color: #a0522d;">after</span>;
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">timeval</span> <span style="color: #a0522d;">timecheck</span>;

<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">mo_value</span> = (<span style="color: #228b22;">double</span>*) calloc(<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>), point_num*mo_num);
<span style="color: #a020f0;">if</span> (mo_value == <span style="color: #008b8b;">NULL</span>) {
  fprintf(stderr, <span style="color: #8b2252;">"Allocation failed (mo_value)\n"</span>);
  exit(1);
}

gettimeofday(&amp;timecheck, <span style="color: #008b8b;">NULL</span>);
before = (<span style="color: #228b22;">long</span>)timecheck.tv_sec * 1000 + (<span style="color: #228b22;">long</span>)timecheck.tv_usec / 1000;

rc = qmckl_get_mo_basis_mo_value(context, mo_value, point_num*mo_num);
<span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
  fprintf(stderr, <span style="color: #8b2252;">"Error getting mo_value)\n"</span>);
  exit(1);
}

gettimeofday(&amp;timecheck, <span style="color: #008b8b;">NULL</span>);
after = (<span style="color: #228b22;">long</span>)timecheck.tv_sec * 1000 + (<span style="color: #228b22;">long</span>)timecheck.tv_usec / 1000;

printf(<span style="color: #8b2252;">"Number of MOs: %ld\n"</span>, (<span style="color: #228b22;">long</span>) mo_num);
printf(<span style="color: #8b2252;">"Number of grid points: %ld\n"</span>, (<span style="color: #228b22;">long</span>) point_num);
printf(<span style="color: #8b2252;">"Execution time : %f seconds\n"</span>, (after - before)*1.e-3);

</pre>
</div>

<pre class="example">
Number of MOs:  201
Number of grid points:  1728000
Execution time :  5.608000 seconds
</pre>

<p>
and finally we compute the overlap between all the MOs as
\(M.M^\dagger\).
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">overlap</span> = (<span style="color: #228b22;">double</span>*) <span style="color: #0000ff;">malloc</span> (<span style="color: #228b22;">mo_num</span>*<span style="color: #0000ff;">mo_num</span>*<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));

  rc = qmckl_dgemm(context, <span style="color: #8b2252;">'N'</span>, <span style="color: #8b2252;">'T'</span>, mo_num, mo_num, point_num, dr,
                   mo_value, mo_num, mo_value, mo_num, 0.0,
                   overlap, mo_num);

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;mo_num ; ++i) {
    printf(<span style="color: #8b2252;">"%4ld"</span>, i);
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">j</span>=0 ; j&lt;mo_num ; ++j) {
      printf(<span style="color: #8b2252;">" %f"</span>, overlap[i*mo_num+j]);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
  }

  // <span style="color: #b22222;">Clean-up and exit</span>
  <span style="color: #0000ff;">free</span>(mo_value);
  <span style="color: #0000ff;">free</span>(overlap);

  rc = qmckl_context_destroy(context);
  <span style="color: #a020f0;">if</span> (rc != QMCKL_SUCCESS) {
    fprintf(stderr, <span style="color: #8b2252;">"Error destroying context)\n"</span>);
    exit(1);
  }

  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
  0 0.988765 0.002336 0.000000 -0.000734 0.000000 0.000530 0.000000 0.000446 0.000000 -0.000000 -0.000511 -0.000000 -0.000267 0.000000 0.000000 0.001007 0.000000 0.000168 -0.000000 -0.000000 -0.000670 -0.000000 0.000000 -0.000251 -0.000261 -0.000000 -0.000000 -0.000000 -0.000397 -0.000000 -0.000810 0.000000 0.000231 -0.000000 -0.000000 0.000000 -0.000000
  ...
200 0.039017 -0.013066 -0.000000 -0.001935 -0.000000 -0.003829 -0.000000 0.000996 -0.000000 0.000000 -0.003733 0.000000 0.000065 -0.000000 -0.000000 -0.002220 -0.000000 -0.001961 0.000000 0.000000 -0.004182 0.000000 -0.000000 -0.000165 -0.002445 0.000000 -0.000000 0.000000 0.001985 0.000000 0.001685 -0.000000 -0.002899 0.000000 0.000000 0.000000 -0.000000 0.002591 0.000000 -0.000000 0.000000 0.002385 0.000000 -0.011086 0.000000 -0.003885 0.000000 -0.000000 0.003602 -0.000000 0.000000 -0.003241 0.000000 0.000000 0.002613 -0.007344 -0.000000 -0.000000 0.000000 0.000017 0.000000 0.000000 0.000000 -0.008719 0.000000 -0.001358 -0.003233 0.000000 -0.000000 -0.000000 -0.000000 0.000000 0.003778 0.000000 0.000000 -0.000000 0.000000 0.000000 -0.001190 0.000000 0.000000 -0.000000 0.005578 -0.000000 -0.001502 0.003899 -0.000000 -0.000000 0.000000 -0.003291 -0.001775 -0.000000 -0.002374 0.000000 -0.000000 -0.000000 -0.000000 -0.001290 -0.000000 0.002178 0.000000 0.000000 0.000000 -0.001252 0.000000 -0.000000 -0.000926 0.000000 -0.000000 -0.013130 -0.000000 0.012124 0.000000 -0.000000 -0.000000 -0.000000 0.000000 0.025194 0.000343 -0.000000 0.000000 -0.000000 -0.004421 0.000000 0.000000 -0.000599 -0.000000 0.005289 0.000000 -0.000000 0.012826 -0.000000 0.000000 0.006190 0.000000 0.000000 -0.000000 0.000000 -0.000321 0.000000 -0.000000 -0.000000 0.000000 -0.000000 0.001499 -0.006629 0.000000 0.000000 0.000000 -0.000000 0.008737 -0.000000 0.006880 0.000000 -0.001851 -0.000000 -0.000000 0.000000 -0.007464 0.000000 0.010298 -0.000000 -0.000000 -0.000000 -0.000000 -0.000000 0.000000 0.000540 0.000000 -0.006616 -0.000000 0.000000 -0.002927 -0.000000 0.000000 0.010352 0.000000 -0.003103 -0.000000 -0.007640 -0.000000 -0.000000 0.005302 0.000000 0.000000 -0.000000 -0.000000 -0.010181 0.000000 -0.001108 0.000000 0.000000 -0.000000 0.000000 0.000000 -0.000998 -0.009754 0.013562 0.000000 -0.000000 0.887510
</pre>
</div>
</div>
