qmckl_examples.html


<div id="outline-container-org3b53bb5" class="outline-3">
<h3 id="org3b53bb5"><span class="section-number-3">1.3</span> Fortran</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Here is the same piece of code translated in Fortran
</p>
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;qmckl_f.F90&gt;</span>

<span style="color: #a020f0;">program</span> <span style="color: #0000ff;">main</span>
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">iso_c_binding</span>
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

  ! <span style="color: #b22222;">Declare variables</span>
  <span style="color: #228b22;">integer</span> ::<span style="color: #a0522d;"> argc</span>
  <span style="color: #228b22;">character</span>(128) ::<span style="color: #a0522d;"> trexio_filename, err_msg</span>
  <span style="color: #228b22;">integer</span>(qmckl_exit_code) ::<span style="color: #a0522d;"> rc</span>
  <span style="color: #228b22;">integer</span>(qmckl_context) ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> nucl_num, mo_num, point_num</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> nucl_coord(:,:)</span>
  <span style="color: #228b22;">integer</span>*8  ::<span style="color: #a0522d;"> nx(3)</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">dimension</span>(3) ::<span style="color: #a0522d;"> shift, step, rmin, rmax</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> mo_value(:,:), overlap(:,:), point(:), linspace(:,:)</span>
  <span style="color: #228b22;">double precision</span> ::<span style="color: #a0522d;"> before, after, dr</span>
  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i,j,k,m</span>

  ! <span style="color: #b22222;">Initialize variables</span>
  err_msg = <span style="color: #8b2252;">' '</span> 
  argc = <span style="color: #a020f0;">command_argument_count</span>()
  <span style="color: #a020f0;">if</span> (argc /= 1) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">"Usage: ./program &lt;TREXIO filename&gt;"</span>
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>
  <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">get_command_argument</span>(1, trexio_filename)
  rc = QMCKL_SUCCESS

  ! <span style="color: #b22222;">Create a QMCkl context</span>
  context = qmckl_context_create()

  ! <span style="color: #b22222;">Read the TREXIO file into the context</span>
  rc = qmckl_trexio_read(context, <span style="color: #a020f0;">trim</span>(trexio_filename), <span style="color: #a020f0;">len</span>(trexio_filename)*1_8)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error reading TREXIO file:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Retrieve the number of nuclei</span>
  rc = qmckl_get_nucleus_num(context, nucl_num)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error getting nucl_num:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Retrieve the nuclear coordinates</span>
  <span style="color: #a020f0;">allocate</span>(nucl_coord(3, nucl_num))
  rc = qmckl_get_nucleus_coord(context, <span style="color: #8b2252;">'N'</span>, nucl_coord, nucl_num * 3_8)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error getting nucl_coord:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Retrieve the number of MOs</span>
  rc = qmckl_get_mo_basis_mo_num(context, mo_num)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error getting mo_num:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Initialize grid points for the calculation</span>
  nx = (/ 120, 120, 120 /)
  shift = (/ 5.d0, 5.d0, 5.d0 /)
  point_num = nx(1) * nx(2) * nx(3)

  ! <span style="color: #b22222;">Initialize rmin and rmax</span>
  rmin = nucl_coord(:,1)
  rmax = nucl_coord(:,1)

  ! <span style="color: #b22222;">Update rmin and rmax based on nucl_coord</span>
  <span style="color: #a020f0;">do</span> i = 1, 3
    <span style="color: #a020f0;">do</span> j = 1, nucl_num
      rmin(i) = <span style="color: #a020f0;">min</span>(nucl_coord(i,j), rmin(i))
      rmax(i) = <span style="color: #a020f0;">max</span>(nucl_coord(i,j), rmax(i))
    <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

  ! <span style="color: #b22222;">Apply shift</span>
  rmin = rmin - shift
  rmax = rmax + shift

  ! <span style="color: #b22222;">Initialize linspace and step</span>
  <span style="color: #a020f0;">allocate</span>(linspace(3, <span style="color: #a020f0;">maxval</span>(nx)))

  <span style="color: #a020f0;">do</span> i = 1, 3
    step(i) = (rmax(i) - rmin(i)) / <span style="color: #a020f0;">real</span>(nx(i) - 1, 8)
    <span style="color: #a020f0;">do</span> j = 1, nx(i)
      linspace(i, j) = rmin(i) + (j - 1) * step(i)
    <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

  ! <span style="color: #b22222;">Initialize point array</span>
  <span style="color: #a020f0;">allocate</span>(point(3 * point_num))
  m = 1
  <span style="color: #a020f0;">do</span> i = 1, nx(1)
    <span style="color: #a020f0;">do</span> j = 1, nx(2)
      <span style="color: #a020f0;">do</span> k = 1, nx(3)
        point(m) = linspace(1, i); m = m + 1
        point(m) = linspace(2, j); m = m + 1
        point(m) = linspace(3, k); m = m + 1
      <span style="color: #a020f0;">end do</span>
    <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

  <span style="color: #a020f0;">deallocate</span>(linspace)


  ! <span style="color: #b22222;">Set points in QMCKL context</span>
  rc = qmckl_set_point(context, <span style="color: #8b2252;">'N'</span>, point_num, point, point_num * 3)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error setting point:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>




  ! <span style="color: #b22222;">Perform the actual calculation and measure the time taken</span>
  <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">cpu_time</span>(before)
  <span style="color: #a020f0;">allocate</span>(mo_value(point_num, mo_num))
  rc = qmckl_get_mo_basis_mo_value(context, mo_value, point_num * mo_num)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error getting mo_value:"</span>, err_msg
    <span style="color: #a020f0;">stop</span>
  <span style="color: #a020f0;">end if</span>
  <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">cpu_time</span>(after)

  <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Number of MOs:"</span>, mo_num
  <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Number of grid points:"</span>, point_num
  <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Execution time:"</span>, (after - before), <span style="color: #8b2252;">"seconds"</span>

  ! <span style="color: #b22222;">Compute the overlap matrix</span>
  dr = step(1) * step(2) * step(3)

  <span style="color: #a020f0;">allocate</span>(overlap(mo_num, mo_num))
  rc = qmckl_dgemm(context, <span style="color: #8b2252;">'N'</span>, <span style="color: #8b2252;">'T'</span>, mo_num, mo_num, point_num, dr, <span style="color: #a020f0;">&amp;</span>
                   mo_value, mo_num, mo_value, mo_num, 0.d0, overlap, mo_num)

  ! <span style="color: #b22222;">Print the overlap matrix</span>
  <span style="color: #a020f0;">do</span> i = 1, mo_num
    <span style="color: #a020f0;">write</span>(*,<span style="color: #8b2252;">'(i4)'</span>, advance=<span style="color: #8b2252;">'no'</span>) i
    <span style="color: #a020f0;">do</span> j = 1, mo_num
      <span style="color: #a020f0;">write</span>(*,<span style="color: #8b2252;">'(f8.4)'</span>, advance=<span style="color: #8b2252;">'no'</span>) overlap(i, j)
    <span style="color: #a020f0;">end do</span>
    <span style="color: #a020f0;">write</span>(*,*)
  <span style="color: #a020f0;">end do</span>

  ! <span style="color: #b22222;">Clean-up and exit</span>
  <span style="color: #a020f0;">deallocate</span>(mo_value, overlap)
  rc = qmckl_context_destroy(context)
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
    <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, err_msg)
    <span style="color: #a020f0;">write</span>(*,*) <span style="color: #8b2252;">"Error destroying context:"</span>, err_msg
    <span style="color: #a020f0;">stop</span> -1
  <span style="color: #a020f0;">end if</span>

<span style="color: #a020f0;">end program</span> <span style="color: #0000ff;">main</span>
</pre>
</div>
</div>
</div>
</div>
