qmckl_examples.html
<div id="outline-container-org8f57567" class="outline-2">
<h2 id="org8f57567"><span class="section-number-2">2</span> Fortran</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1446f90" class="outline-3">
<h3 id="org1446f90"><span class="section-number-3">2.1</span> Checking errors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
All QMCkl functions return an error code. A convenient way to handle
errors is to write an error-checking function that displays the
error in text format and exits the program.
</p>

<div class="org-src-container">
<pre class="src src-f90" id="org36e3e87"><span style="color: #a020f0;">subroutine</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, message)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_exit_code), <span style="color: #a020f0;">intent</span>(in) ::<span style="color: #a0522d;"> rc</span>
  <span style="color: #228b22;">character</span>(len=*)        , <span style="color: #a020f0;">intent</span>(in) ::<span style="color: #a0522d;"> message</span>
  <span style="color: #228b22;">character</span>(len=128)                   ::<span style="color: #a0522d;"> str_buffer</span>
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">print</span> *, message
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, str_buffer)
     <span style="color: #a020f0;">print</span> *, str_buffer
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(rc)
  <span style="color: #a020f0;">end if</span>
<span style="color: #a020f0;">end subroutine</span> <span style="color: #0000ff;">qmckl_check_error</span>
</pre>
</div>
</div>
</div>
