qmckl_examples.html

<div id="outline-container-org32d6be8" class="outline-3">
<h3 id="org32d6be8"><span class="section-number-3">2.2</span> Computing an atomic orbital on a grid</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The following program, in Fortran, computes the values of an atomic
orbital on a regular 3-dimensional grid. The 100<sup>3</sup> grid points are
automatically defined, such that the molecule fits in a box with 5
atomic units in the borders.
</p>

<p>
This program uses the <code>qmckl_check_error</code> function defined above.
</p>

<p>
To use this program, run
</p>

<div class="org-src-container">
<pre class="src src-bash">$ ao_grid &lt;trexio_file&gt; &lt;AO_id&gt; &lt;point_num&gt;
</pre>
</div>


<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">subroutine</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, message)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_exit_code), <span style="color: #a020f0;">intent</span>(in) ::<span style="color: #a0522d;"> rc</span>
  <span style="color: #228b22;">character</span>(len=*)        , <span style="color: #a020f0;">intent</span>(in) ::<span style="color: #a0522d;"> message</span>
  <span style="color: #228b22;">character</span>(len=128)                   ::<span style="color: #a0522d;"> str_buffer</span>
  <span style="color: #a020f0;">if</span> (rc /= QMCKL_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">print</span> *, message
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_string_of_error</span>(rc, str_buffer)
     <span style="color: #a020f0;">print</span> *, str_buffer
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(rc)
  <span style="color: #a020f0;">end if</span>
<span style="color: #a020f0;">end subroutine</span> <span style="color: #0000ff;">qmckl_check_error</span>

<span style="color: #a020f0;">program</span> <span style="color: #0000ff;">ao_grid</span>
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

  <span style="color: #228b22;">integer</span>(qmckl_context)    ::<span style="color: #a0522d;"> qmckl_ctx  </span>! <span style="color: #b22222;">QMCkl context</span>
  <span style="color: #228b22;">integer</span>(qmckl_exit_code)  ::<span style="color: #a0522d;"> rc         </span>! <span style="color: #b22222;">Exit code of QMCkl functions</span>

  <span style="color: #228b22;">character</span>(len=128)            ::<span style="color: #a0522d;"> trexio_filename</span>
  <span style="color: #228b22;">character</span>(len=128)            ::<span style="color: #a0522d;"> str_buffer</span>
  <span style="color: #228b22;">integer</span>                       ::<span style="color: #a0522d;"> ao_id</span>
  <span style="color: #228b22;">integer</span>                       ::<span style="color: #a0522d;"> point_num_x</span>

  <span style="color: #228b22;">integer</span>(<span style="color: #008b8b;">c_int64_t</span>)            ::<span style="color: #a0522d;"> nucl_num</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> nucl_coord(:,:)</span>

  <span style="color: #228b22;">integer</span>(<span style="color: #008b8b;">c_int64_t</span>)            ::<span style="color: #a0522d;"> point_num</span>
  <span style="color: #228b22;">integer</span>(<span style="color: #008b8b;">c_int64_t</span>)            ::<span style="color: #a0522d;"> ao_num</span>
  <span style="color: #228b22;">integer</span>(<span style="color: #008b8b;">c_int64_t</span>)            ::<span style="color: #a0522d;"> ipoint, i, j, k</span>
  <span style="color: #228b22;">double precision</span>              ::<span style="color: #a0522d;"> x, y, z, dr(3)</span>
  <span style="color: #228b22;">double precision</span>              ::<span style="color: #a0522d;"> rmin(3), rmax(3)</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> points(:,:)</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> ao_vgl(:,:,:)</span>
</pre>
</div>

<p>
Start by fetching the command-line arguments:
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">if</span> (iargc() /= 3) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Syntax: ao_grid &lt;trexio_file&gt; &lt;AO_id&gt; &lt;point_num&gt;'</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
<span style="color: #a020f0;">end if</span>
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">getarg</span>(1, trexio_filename)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">getarg</span>(2, str_buffer)
<span style="color: #a020f0;">read</span>(str_buffer, *) ao_id
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">getarg</span>(3, str_buffer)
<span style="color: #a020f0;">read</span>(str_buffer, *) point_num_x

<span style="color: #a020f0;">if</span> (point_num_x &lt; 0 <span style="color: #a020f0;">.or.</span> point_num_x &gt; 300) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: 0 &lt; point_num &lt; 300'</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
<span style="color: #a020f0;">end if</span>
</pre>
</div>

<p>
Create the QMCkl context and initialize it with the wave function
present in the TREXIO file:
</p>

<div class="org-src-container">
<pre class="src src-f90">qmckl_ctx = qmckl_context_create()
rc  = qmckl_trexio_read(qmckl_ctx, trexio_filename, 1_8*<span style="color: #a020f0;">len</span>(<span style="color: #a020f0;">trim</span>(trexio_filename)))
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Read TREXIO'</span>)
</pre>
</div>

<p>
We need to check that <code>ao_id</code> is in the range, so we get the total
number of AOs from QMCkl:
</p>

<div class="org-src-container">
<pre class="src src-f90">rc = qmckl_get_ao_basis_ao_num(qmckl_ctx, ao_num)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Getting ao_num'</span>)

<span style="color: #a020f0;">if</span> (ao_id &lt; 0 <span style="color: #a020f0;">.or.</span> ao_id &gt; ao_num) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: 0 &lt; ao_id &lt; '</span>, ao_num
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
<span style="color: #a020f0;">end if</span>
</pre>
</div>

<p>
Now we will compute the limits of the box in which the molecule fits.
For that, we first need to ask QMCkl the coordinates of nuclei.
</p>

<div class="org-src-container">
<pre class="src src-f90">rc = qmckl_get_nucleus_num(qmckl_ctx, nucl_num)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Get nucleus num'</span>)

<span style="color: #a020f0;">allocate</span>( nucl_coord(3, nucl_num) )
rc = qmckl_get_nucleus_coord(qmckl_ctx, <span style="color: #8b2252;">'N'</span>, nucl_coord, 3_8*nucl_num)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Get nucleus coord'</span>)
</pre>
</div>

<p>
We now compute the coordinates of opposite points of the box, and
the distance between points along the 3 directions:
</p>

<div class="org-src-container">
<pre class="src src-f90">rmin(1) = <span style="color: #a020f0;">minval</span>( nucl_coord(1,:) ) - 5.d0
rmin(2) = <span style="color: #a020f0;">minval</span>( nucl_coord(2,:) ) - 5.d0
rmin(3) = <span style="color: #a020f0;">minval</span>( nucl_coord(3,:) ) - 5.d0

rmax(1) = <span style="color: #a020f0;">maxval</span>( nucl_coord(1,:) ) + 5.d0
rmax(2) = <span style="color: #a020f0;">maxval</span>( nucl_coord(2,:) ) + 5.d0
rmax(3) = <span style="color: #a020f0;">maxval</span>( nucl_coord(3,:) ) + 5.d0

dr(1:3) = (rmax(1:3) - rmin(1:3)) / <span style="color: #a020f0;">dble</span>(point_num_x-1)
</pre>
</div>

<p>
We now produce the list of point coordinates where the AO will be
evaluated:
</p>

<div class="org-src-container">
<pre class="src src-f90">point_num = point_num_x**3
<span style="color: #a020f0;">allocate</span>( points(point_num, 3) )
ipoint=0
z = rmin(3)
<span style="color: #a020f0;">do</span> k=1,point_num_x
   y = rmin(2)
   <span style="color: #a020f0;">do</span> j=1,point_num_x
      x = rmin(1)
      <span style="color: #a020f0;">do</span> i=1,point_num_x
         ipoint = ipoint+1
         points(ipoint,1) = x
         points(ipoint,2) = y
         points(ipoint,3) = z
         x = x + dr(1)
      <span style="color: #a020f0;">end do</span>
      y = y + dr(2)
   <span style="color: #a020f0;">end do</span>
   z = z + dr(3)
<span style="color: #a020f0;">end do</span>
</pre>
</div>

<p>
We give the points to QMCkl:
</p>

<div class="org-src-container">
<pre class="src src-f90">rc = qmckl_set_point(qmckl_ctx, <span style="color: #8b2252;">'T'</span>, point_num, points, <span style="color: #a020f0;">size</span>(points)*1_8 )
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Setting points'</span>)
</pre>
</div>

<p>
We allocate the space required to retrieve the values, gradients and
Laplacian of all AOs, and ask to retrieve the values of the
AOs computed at the point positions.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">allocate</span>( ao_vgl(ao_num, 5, point_num) )
rc = qmckl_get_ao_basis_ao_vgl(qmckl_ctx, ao_vgl, ao_num*5_8*point_num)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">qmckl_check_error</span>(rc, <span style="color: #8b2252;">'Setting points'</span>)
</pre>
</div>

<p>
We finally print the value and Laplacian of the AO:
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">do</span> ipoint=1, point_num
   <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'(3(F10.6,X),2(E20.10,X))'</span>, points(ipoint, 1:3), ao_vgl(ao_id,1,ipoint), ao_vgl(ao_id,5,ipoint)
<span style="color: #a020f0;">end do</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90">  <span style="color: #a020f0;">deallocate</span>( nucl_coord, points, ao_vgl )
<span style="color: #a020f0;">end program</span> <span style="color: #0000ff;">ao_grid</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2024-12-14 Sat 00:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
